backend/app/controllers/my_books_controller.rb

    def create
        puts 'aaa'
        puts params
        @my_book =current_user.my_books.new(my_book_params)
        @my_book.read||=0
        if @my_book.save
---
INSERT INTO "my_books" ("title", "author", "created_at", "updated_at", "user_id", "read", "have", "isbn", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("id", "name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)  [["id", 1], ["name", "yokoyu"], ["email", "yoko@yoko.com"], ["created_at", "2024-12-18 11:54:29.263928"], ["updated_at", "2024-12-18 11:54:29.263928"], ["password_digest", "[FILTERED]"]]

    def destroy
        @my_book=MyBook.find(params[:id])
        if @my_book
            @my_book.destroy
---
SELECT "my_books".* FROM "my_books" WHERE "my_books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "my_books" WHERE "my_books"."id" = ?  [["id", 1]]