backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "yokoyoko@yu.com"], ["LIMIT", 1]]
---
    def create
        puts "params:#{params}"
        user=User.find_by(email: params[:session][:email].downcase)