backend/app/controllers/users_controller.rb

    def create
        @user=User.new(user_resources)
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["name", "yoko"], ["email", "yokoyoko@yoko.com"], ["created_at", "2024-12-19 10:21:04.609630"], ["updated_at", "2024-12-19 10:21:04.609630"], ["password_digest", "[FILTERED]"]]